
const fs = require("fs");

// const string = `6 5\n1 1 0 1 1\n0 1 1 0 0\n0 0 0 0 0\n1 0 1 1 1\n0 0 1 1 1\n0 0 1 1 1`;
// fs.readFileSync("/dev/stdin")
let input = fs.readFileSync("/dev/stdin").toString().trim().split("\n");
const [n, m] = input
  .shift()
  .split(" ")
  .map((el) => Number(el));
input = input.map((str) => str.split(" ").map((el) => Number(el))); //input 초기화 + 항상 데이터 타입 신경쓰기...

let queue = [];
let head = 0;
let tail = 0;
const visit = Array.from({ length: n }, () =>
  Array.from({ length: m }, () => 0)
);
const dx = [0, -1, 0, 1];
const dy = [1, 0, -1, 0];
const countArr = [];

function sol(input) {
  for (let i = 0; i < input.length; i++) {
    for (let j = 0; j < input[i].length; j++) {
      if (input[i][j] === 0 || visit[i][j] === 1) continue; //제약 조건
      let count = 0;
      queue[tail++] = [i, j]; //큐에 해당 좌표 삽입
      visit[i][j] = 1; //⭐️중요! 큐에 넣을때 방문처리!!!!!

      while (tail - head !== 0) {
        const [curRow, curCol] = queue[head++]; //헤드 추출(방문 작업)
        // visit[curRow][curCol] = 1; //❌~~등록 위치 조심!~~ -->❌잘못된 부분임!❌
        count++; //카운트 위치도 조심! 항상 **방문 했을때** 카운트 한다.
        for (let d = 0; d < 4; d++) {
          const movedRow = curRow + dx[d];
          const movedCol = curCol + dy[d];

          //🚨범위 신경쓰기!(인덱스랑 갯수랑 기준이 다르다)
          if (
            0 > movedRow ||
            n - 1 < movedRow ||
            movedCol < 0 ||
            m - 1 < movedCol
          )
            continue;

          if (
            //🚨버그 발생... 상하좌우 비교시 해당 지점이 그림이 있는 지역인지 확인을 안했음!
            input[movedRow][movedCol] === 0 ||
            visit[movedRow][movedCol] === 1
          )
            continue;
          queue[tail++] = [movedRow, movedCol]; //큐에 Push만 한다.
          visit[movedRow][movedCol] = 1; //⭐️반드시 큐에 넣기전에 찜(방문처리) 해야한다!!!!
          /*
          ⭐️ 중요한 이유! ⭐️

          처음에 풀었던 것처럼 큐에서 head를 꺼낼때 방문 처리를 하게 되면 현재 노드 기준으로 상하좌우 탐색을 할때 이미 큐에 있는 지점에 방문하더라도 실제로 visit에 방문처리를 안해서 중복으로 큐에 쌓일 수 있다.

          큐에서 꺼낼 때 방문 처리하면:
          1. 현재 위치 A에서 상하좌우를 살펴본다. B가 아직 방문 안 된 것 같아서 큐에 넣는다.
          2. 아직 B가 큐에서 나오지 않았으므로 B는 '방문 안 함' 상태.
          3. 다른 위치 C에서도 상하좌우를 보다가 B를 봅니다. B가 여전히 '방문 안 함' 상태이니 또 큐에 넣는다.
          4. 결과: 같은 좌표가 큐에 여러 번 중복되어 들어가게 되고, count가 실제 넓이보다 훨씬 커지거나 무한 루프처럼 돌게 된다. (메모리 초과 또는 시간 초과 발생)

          큐에 넣을 때 방문 처리하면:
          1. A가 B를 발견하고 큐에 넣으면서 "찜(방문)"을 해버린다.
          2. 나중에 C가 B를 봐도 이미 "찜"이 되어 있으니 큐에 넣지 않는다.
          3. 결과: 정확하게 한 번만 큐에 들어가고 정확한 넓이가 계산된다.

          BFS의 핵심은 **"큐에 넣음과 동시에 방문 도장을 찍는다"**!!!!
          */
        }
      }
      countArr.push(count);
    }
  }
  const drawEA = countArr.length;
  const maxDraw = countArr.length === 0 ? 0 : Math.max(...countArr);
  console.log(`${drawEA}\n${maxDraw}`);
}

sol(input);
